; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 369122 2 3 3 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	image0 - mode
	image2 - mode
	image1 - mode
	Star1 - direction
	Star5 - direction
	Star6 - direction
	GroundStation4 - direction
	GroundStation7 - direction
	Star0 - direction
	Star2 - direction
	Star3 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 image1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star3)
	(supports instrument1 image2)
	(supports instrument1 image1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 image1)
	(supports instrument2 image0)
	(supports instrument2 image2)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument3 image1)
	(supports instrument3 image2)
	(supports instrument3 image0)
	(calibration_target instrument3 Star3)
	(supports instrument4 image2)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 Star2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(pointing satellite0 Star1)
	(pointing satellite1 Star12)
	(have_image Star8 image1)
	(have_image Star9 image0)
	(have_image Planet10 image0)
	(have_image Star11 image1)
	(have_image Star12 image2)
	(have_image Phenomenon13 image2)
))

)

; plan
1. (turn_to satellite1 star12 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star12)
   goals met: 1 of 8
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 8
3. (turn_to satellite0 star12 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star12)
   goals met: 1 of 8
4. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 8
5. (turn_to satellite0 star1 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star1)
   goals met: 2 of 8
6. (turn_to satellite1 star3 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star3)
   goals met: 1 of 8
7. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 1 of 8
8. (turn_to satellite0 star8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star8)
   goals met: 0 of 8
9. (turn_to satellite1 star9 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star9)
   goals met: 0 of 8
10. (turn_to satellite0 star11 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star11)
   goals met: 0 of 8
11. (take_image satellite1 star9 instrument3 image0)
   added: (have_image star9 image0)
   goals met: 1 of 8
12. (turn_to satellite0 star8 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star8)
   goals met: 1 of 8
13. (turn_to satellite1 star12 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star12)
   goals met: 2 of 8
14. (turn_to satellite0 star1 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star1)
   goals met: 3 of 8
15. (take_image satellite1 star12 instrument3 image2)
   added: (have_image star12 image2)
   goals met: 4 of 8
16. (turn_to satellite0 groundstation4 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 groundstation4)
   goals met: 3 of 8
17. (turn_to satellite1 star8 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star8)
   goals met: 2 of 8
18. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 2 of 8
19. (turn_to satellite0 star11 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star11)
   goals met: 2 of 8
20. (take_image satellite1 star8 instrument3 image1)
   added: (have_image star8 image1)
   goals met: 3 of 8
21. (take_image satellite0 star11 instrument1 image1)
   added: (have_image star11 image1)
   goals met: 4 of 8
22. (turn_to satellite1 star12 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star12)
   goals met: 5 of 8
23. (turn_to satellite0 star1 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star1)
   goals met: 6 of 8
24. (turn_to satellite1 planet10 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 planet10)
   goals met: 5 of 8
25. (take_image satellite1 planet10 instrument3 image0)
   added: (have_image planet10 image0)
   goals met: 6 of 8
26. (turn_to satellite0 phenomenon13 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon13)
   goals met: 5 of 8
27. (turn_to satellite1 star12 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star12)
   goals met: 6 of 8
28. (take_image satellite0 phenomenon13 instrument1 image2)
   added: (have_image phenomenon13 image2)
   goals met: 7 of 8
29. (turn_to satellite0 star1 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star1)
   goals met: 8 of 8
